#+TITLE: Testing Orgmode Code Block Rendering  

* Code Blocks
** default

#+BEGIN_SRC shell :eval never
date
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
Tue Aug 20 21:14:51 UTC 2019
#+END_EXAMPLE

** code

 #+BEGIN_SRC shell :eval never :exports code
 date
 #+END_SRC

 #+RESULTS:
 #+BEGIN_EXAMPLE
 Tue Aug 20 21:14:51 UTC 2019
 #+END_EXAMPLE

** results

 #+BEGIN_SRC shell :eval never :exports results
 date
 #+END_SRC

 #+RESULTS:
 #+BEGIN_EXAMPLE
 Tue Aug 20 21:14:51 UTC 2019
 #+END_EXAMPLE

** both

 #+BEGIN_SRC shell :eval never :exports both
 date
 #+END_SRC

 #+RESULTS:
 #+BEGIN_EXAMPLE
 Tue Aug 20 21:14:51 UTC 2019
 #+END_EXAMPLE

** none

 #+BEGIN_SRC shell :eval never :exports none
 date
 #+END_SRC

 #+RESULTS:
 #+BEGIN_EXAMPLE
 Tue Aug 20 21:14:51 UTC 2019
 #+END_EXAMPLE

* Test Cases
** Directory Listing

#+BEGIN_SRC shell :exports both
tree -d /usr/local/elpa-mirror                                                                                   
#+END_SRC                                                                                                        

#+RESULTS:                                                                                                       
#+begin_EXAMPLE                                                                                                  
- /usr/local/elpa-mirror                                                                                         
- ├── gnu                                                                                                        
- ├── melpa                                                                                                      
- ├── org                                                                                                        
- └── stable-melpa                                                                                               
- 4 directories                                                                                                  
#+end_EXAMPLE

* References

- [[https://orgmode.org/manual/Exporting-code-blocks.html][https://orgmode.org/manual/Exporting-code-blocks.html]]
- [[https://github.com/bdewey/org-ruby][https://github.com/bdewey/org-ruby]]
